# dp[자리수][앞에오는숫자] = 경우의 수
# 자리수: 1부터 n까지
# 앞에오는숫자: 0~9 -> 10가지

# 앞에오는숫자  0  1  2  3  4  5  6  7  8  9
# =======================================
# 자릿수(0)   0  0  0  0  0  0  0  0  0  0
# 자릿수(1)   0  1  1  1  1  1  1  1  1  1
# 자릿수(2)   1  1  2  2  2  2  2  2  2  1
# 자릿수(3)   1  3  3  4  4  4  4  4  3  2

n = int(input())

dp = [[0] * 10 for _ in range(n + 1)]

for i in range(1, 10):
	dp[1][i] = 1

for i in range(2, n + 1):
	for j in range(10):
		if j == 0:
			dp[i][j] = dp[i-1][1]
		elif j == 9:
			dp[i][j] = dp[i-1][8]
		else: # 1 ~ 8
			dp[i][j] = dp[i-1][j-1] + dp[i-1][j+1]

print(sum(dp[n]) % 1000000000)
